Revit 2027 API
RebarSplice.SplicePosition Property
 Identifies the splice position.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public RebarSplicePosition SplicePosition { get; set; }
Public Property SplicePosition As RebarSplicePosition
	Get
	Set
public:
property RebarSplicePosition SplicePosition {
	RebarSplicePosition get ();
	void set (RebarSplicePosition value);
}
member SplicePosition : RebarSplicePosition with get, set
Property Value
RebarSplicePosition
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Remarks
This property describes the position of the splice face with respect to each bar end involved in splice.
Middle describes the behavior when both bar ends extends with half of the lap length and the splice plane sits between them.
End1 and End2 describes the behavior when one of the bar ends is on the splice plane and the other bar end extends with the lap length. End1 means that the lap is computed towards the start of the splice chain, while End2 means that the lap is computed towards the end of the splice chain. If the Rebar is not part of a splice chain, End1 will be computed towards to the end of the bar and End2 to the start of the bar.
For more information about the splice chain concept please check Autodesk.Revit.DB.Structure.RebarSpliceUtils.GetSpliceChain(Rebar rebar).
See Also
Reference
RebarSplice Class
Autodesk.Revit.DB.Structure Namespace